// 1.文字の出力
// 「Hello World」とコンソールに出力してください
console.log("Hello World");
// →Hello World

// 「にんじゃわんこ」とコンソールに出力してください
console.log("にんじゃわんこ");
// →にんじゃわんこ

// 以下の行をコメントアウトしてください
//console.log("この行をコメントアウトしてください");


// 2.文字列と計算について(1)
// 5と3を足した値を出力してください
console.log(5 + 3);
// →8

// 20から8を引いた値を出力してください
console.log(20 - 8);
// →12

// "4 + 5" を文字列として出力してください
console.log("4 + 5");
// →4 + 5


// 3.文字列と計算について(2)
// 8と4をかけた結果を出力してください
console.log(8 * 4);
// →32

// 24を4で割った結果を出力してください
console.log(24 / 4);
// →6

// 7を2で割った余りを出力してください
console.log(7 % 2);
// →1


// 4.文字の連結
// 「ひつじ」と「仙人」を連結してコンソールに出力してください
console.log("ひつじ" + "仙人");
// →ひつじ仙人

// 文字列の「20」と「15」を連結してコンソールに出力してください
console.log("20" + "15");
// →2015